ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_gpt_lld.c
  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM2_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM2 */

#if GD32_GPT_USE_TIM3 || defined(__DOXYGEN__)
#if !defined(GD32_TIM3_SUPPRESS_ISR)
#if !defined(GD32_TIM3_HANDLER)
#error "GD32_TIM3_HANDLER not defined"
#endif
/**
 * @brief   TIM3 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM3_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD3);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM3_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM3 */

#if GD32_GPT_USE_TIM4 || defined(__DOXYGEN__)
#if !defined(GD32_TIM4_SUPPRESS_ISR)
#if !defined(GD32_TIM4_HANDLER)
#error "GD32_TIM4_HANDLER not defined"
#endif
/**
 * @brief   TIM4 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM4_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD4);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM4_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM4 */

#if GD32_GPT_USE_TIM5 || defined(__DOXYGEN__)
#if !defined(GD32_TIM5_SUPPRESS_ISR)
#if !defined(GD32_TIM5_HANDLER)
#error "GD32_TIM5_HANDLER not defined"
#endif
/**
 * @brief   TIM5 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM5_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD5);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM5_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM5 */

#if GD32_GPT_USE_TIM6 || defined(__DOXYGEN__)
#if !defined(GD32_TIM6_SUPPRESS_ISR)
#if !defined(GD32_TIM6_HANDLER)
#error "GD32_TIM6_HANDLER not defined"
#endif
/**
 * @brief   TIM6 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM6_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD6);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM6_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM6 */

#if GD32_GPT_USE_TIM7 || defined(__DOXYGEN__)
#if !defined(GD32_TIM7_SUPPRESS_ISR)
#if !defined(GD32_TIM7_HANDLER)
#error "GD32_TIM7_HANDLER not defined"
#endif
/**
 * @brief   TIM7 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM7_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD7);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM7_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM7 */

#if GD32_GPT_USE_TIM8 || defined(__DOXYGEN__)
#if !defined(GD32_TIM8_SUPPRESS_ISR)
#if !defined(GD32_TIM8_UP_HANDLER)
#error "GD32_TIM8_UP_HANDLER not defined"
#endif
/**
 * @brief   TIM8 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM8_UP_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD8);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM8_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM8 */

#if GD32_GPT_USE_TIM9 || defined(__DOXYGEN__)
#if !defined(GD32_TIM9_SUPPRESS_ISR)
#error "TIM9 ISR not defined by platform"
#endif /* !defined(GD32_TIM9_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM9 */

#if GD32_GPT_USE_TIM10 || defined(__DOXYGEN__)
#if !defined(GD32_TIM10_SUPPRESS_ISR)
#error "TIM10 ISR not defined by platform"
#endif /* !defined(GD32_TIM10_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM10 */

#if GD32_GPT_USE_TIM11 || defined(__DOXYGEN__)
#if !defined(GD32_TIM11_SUPPRESS_ISR)
#error "TIM11 ISR not defined by platform"
#endif /* !defined(GD32_TIM11_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM11 */

#if GD32_GPT_USE_TIM12 || defined(__DOXYGEN__)
#if !defined(GD32_TIM12_SUPPRESS_ISR)
#error "TIM12 ISR not defined by platform"
#endif /* !defined(GD32_TIM12_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM12 */

#if GD32_GPT_USE_TIM13 || defined(__DOXYGEN__)
#if !defined(GD32_TIM13_SUPPRESS_ISR)
#error "TIM13 ISR not defined by platform"
#endif /* !defined(GD32_TIM13_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM13 */

#if GD32_GPT_USE_TIM14 || defined(__DOXYGEN__)
#if !defined(GD32_TIM14_SUPPRESS_ISR)
#error "TIM14 ISR not defined by platform"
#endif /* !defined(GD32_TIM14_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM14 */

#if GD32_GPT_USE_TIM15 || defined(__DOXYGEN__)
#if !defined(GD32_TIM15_SUPPRESS_ISR)
#error "TIM15 ISR not defined by platform"
#endif /* !defined(GD32_TIM15_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM15 */

#if GD32_GPT_USE_TIM16 || defined(__DOXYGEN__)
#if !defined(GD32_TIM16_SUPPRESS_ISR)
#error "TIM16 ISR not defined by platform"
#endif /* !defined(GD32_TIM16_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM16 */

#if GD32_GPT_USE_TIM17 || defined(__DOXYGEN__)
#if !defined(GD32_TIM17_SUPPRESS_ISR)
#error "TIM17 ISR not defined by platform"
#endif /* !defined(GD32_TIM17_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM17 */

#if GD32_GPT_USE_TIM21 || defined(__DOXYGEN__)
#if !defined(GD32_TIM21_SUPPRESS_ISR)
#if !defined(GD32_TIM21_HANDLER)
#error "GD32_TIM21_HANDLER not defined"
#endif
/**
 * @brief   TIM21 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM21_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD21);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM21_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM21 */

#if GD32_GPT_USE_TIM22 || defined(__DOXYGEN__)
#if !defined(GD32_TIM22_SUPPRESS_ISR)
#if !defined(GD32_TIM22_HANDLER)
#error "GD32_TIM22_HANDLER not defined"
#endif
/**
 * @brief   TIM22 interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(GD32_TIM22_HANDLER) {

  OSAL_IRQ_PROLOGUE();

  gpt_lld_serve_interrupt(&GPTD22);

  OSAL_IRQ_EPILOGUE();
}
#endif /* !defined(GD32_TIM22_SUPPRESS_ISR) */
#endif /* GD32_GPT_USE_TIM22 */

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @brief   Low level GPT driver initialization.
 *
 * @notapi
 */
void gpt_lld_init(void) {

#if GD32_GPT_USE_TIM1
  /* Driver initialization.*/
  GPTD1.tim = GD32_TIM1;
  gptObjectInit(&GPTD1);
#endif

#if GD32_GPT_USE_TIM2
  /* Driver initialization.*/
  GPTD2.tim = GD32_TIM2;
  gptObjectInit(&GPTD2);
#endif

#if GD32_GPT_USE_TIM3
  /* Driver initialization.*/
  GPTD3.tim = GD32_TIM3;
  gptObjectInit(&GPTD3);
#endif

#if GD32_GPT_USE_TIM4
  /* Driver initialization.*/
  GPTD4.tim = GD32_TIM4;
  gptObjectInit(&GPTD4);
#endif

#if GD32_GPT_USE_TIM5
  /* Driver initialization.*/
  GPTD5.tim = GD32_TIM5;
  gptObjectInit(&GPTD5);
#endif

#if GD32_GPT_USE_TIM6
  /* Driver initialization.*/
  GPTD6.tim = GD32_TIM6;
  gptObjectInit(&GPTD6);
#endif

#if GD32_GPT_USE_TIM7
  /* Driver initialization.*/
  GPTD7.tim = GD32_TIM7;
  gptObjectInit(&GPTD7);
#endif

#if GD32_GPT_USE_TIM8
  /* Driver initialization.*/
  GPTD8.tim = GD32_TIM8;
  gptObjectInit(&GPTD8);
#endif

