ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_gpt_lld.c
#if GD32_GPT_USE_TIM9
  /* Driver initialization.*/
  GPTD9.tim = GD32_TIM9;
  gptObjectInit(&GPTD9);
#endif

#if GD32_GPT_USE_TIM10
  /* Driver initialization.*/
  GPTD10.tim = GD32_TIM10;
  gptObjectInit(&GPTD10);
#endif

#if GD32_GPT_USE_TIM11
  /* Driver initialization.*/
  GPTD11.tim = GD32_TIM11;
  gptObjectInit(&GPTD11);
#endif

#if GD32_GPT_USE_TIM12
  /* Driver initialization.*/
  GPTD12.tim = GD32_TIM12;
  gptObjectInit(&GPTD12);
#endif

#if GD32_GPT_USE_TIM13
  /* Driver initialization.*/
  GPTD13.tim = GD32_TIM13;
  gptObjectInit(&GPTD13);
#endif

#if GD32_GPT_USE_TIM14
  /* Driver initialization.*/
  GPTD14.tim = GD32_TIM14;
  gptObjectInit(&GPTD14);
#endif

#if GD32_GPT_USE_TIM15
  /* Driver initialization.*/
  GPTD15.tim = GD32_TIM15;
  gptObjectInit(&GPTD15);
#endif

#if GD32_GPT_USE_TIM16
  /* Driver initialization.*/
  GPTD16.tim = GD32_TIM16;
  gptObjectInit(&GPTD16);
#endif

#if GD32_GPT_USE_TIM17
  /* Driver initialization.*/
  GPTD17.tim = GD32_TIM17;
  gptObjectInit(&GPTD17);
#endif

#if GD32_GPT_USE_TIM21
  /* Driver initialization.*/
  GPTD21.tim = GD32_TIM21;
  gptObjectInit(&GPTD21);
#endif

#if GD32_GPT_USE_TIM22
  /* Driver initialization.*/
  GPTD22.tim = GD32_TIM22;
  gptObjectInit(&GPTD22);
#endif
}

/**
 * @brief   Configures and activates the GPT peripheral.
 *
 * @param[in] gptp      pointer to the @p GPTDriver object
 *
 * @notapi
 */
void gpt_lld_start(GPTDriver *gptp) {
  uint16_t psc;

  if (gptp->state == GPT_STOP) {
    /* Clock activation.*/
#if GD32_GPT_USE_TIM1
    if (&GPTD1 == gptp) {
      rccEnableTIM1(true);
      rccResetTIM1();
#if !defined(GD32_TIM1_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM1_UP_NUMBER, GD32_GPT_TIM1_IRQ_PRIORITY, GD32_GPT_TIM1_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM1CLK)
      gptp->clock = GD32_TIM1CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM2
    if (&GPTD2 == gptp) {
      rccEnableTIM2(true);
      rccResetTIM2();
#if !defined(GD32_TIM2_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM2_NUMBER, GD32_GPT_TIM2_IRQ_PRIORITY, GD32_GPT_TIM2_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM2CLK)
      gptp->clock = GD32_TIM2CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM3
    if (&GPTD3 == gptp) {
      rccEnableTIM3(true);
      rccResetTIM3();
#if !defined(GD32_TIM3_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM3_NUMBER, GD32_GPT_TIM3_IRQ_PRIORITY, GD32_GPT_TIM3_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM3CLK)
      gptp->clock = GD32_TIM3CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM4
    if (&GPTD4 == gptp) {
      rccEnableTIM4(true);
      rccResetTIM4();
#if !defined(GD32_TIM4_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM4_NUMBER, GD32_GPT_TIM4_IRQ_PRIORITY, GD32_GPT_TIM4_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM4CLK)
      gptp->clock = GD32_TIM4CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM5
    if (&GPTD5 == gptp) {
      rccEnableTIM5(true);
      rccResetTIM5();
#if !defined(GD32_TIM5_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM5_NUMBER, GD32_GPT_TIM5_IRQ_PRIORITY, GD32_GPT_TIM5_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM5CLK)
      gptp->clock = GD32_TIM5CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM6
    if (&GPTD6 == gptp) {
      rccEnableTIM6(true);
      rccResetTIM6();
#if !defined(GD32_TIM6_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM6_NUMBER, GD32_GPT_TIM6_IRQ_PRIORITY, GD32_GPT_TIM6_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM6CLK)
      gptp->clock = GD32_TIM6CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM7
    if (&GPTD7 == gptp) {
      rccEnableTIM7(true);
      rccResetTIM7();
#if !defined(GD32_TIM7_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM7_NUMBER, GD32_GPT_TIM7_IRQ_PRIORITY, GD32_GPT_TIM7_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM7CLK)
      gptp->clock = GD32_TIM7CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM8
    if (&GPTD8 == gptp) {
      rccEnableTIM8(true);
      rccResetTIM8();
#if !defined(GD32_TIM8_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM8_UP_NUMBER, GD32_GPT_TIM8_IRQ_PRIORITY, GD32_GPT_TIM8_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM8CLK)
      gptp->clock = GD32_TIM8CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM9
    if (&GPTD9 == gptp) {
      rccEnableTIM9(true);
      rccResetTIM9();
#if !defined(GD32_TIM9_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM9_NUMBER, GD32_GPT_TIM9_IRQ_PRIORITY, GD32_GPT_TIM9_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM9CLK)
      gptp->clock = GD32_TIM9CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM10
    if (&GPTD10 == gptp) {
      rccEnableTIM10(true);
      rccResetTIM10();
#if !defined(GD32_TIM10_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM10_NUMBER, GD32_GPT_TIM10_IRQ_PRIORITY, GD32_GPT_TIM10_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM10CLK)
      gptp->clock = GD32_TIM10CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM11
    if (&GPTD11 == gptp) {
      rccEnableTIM11(true);
      rccResetTIM11();
#if !defined(GD32_TIM11_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM11_NUMBER, GD32_GPT_TIM11_IRQ_PRIORITY, GD32_GPT_TIM11_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM11CLK)
      gptp->clock = GD32_TIM11CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM12
    if (&GPTD12 == gptp) {
      rccEnableTIM12(true);
      rccResetTIM12();
#if !defined(GD32_TIM12_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM12_NUMBER, GD32_GPT_TIM12_IRQ_PRIORITY, GD32_GPT_TIM12_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM12CLK)
      gptp->clock = GD32_TIM12CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM13
    if (&GPTD13 == gptp) {
      rccEnableTIM13(true);
      rccResetTIM13();
#if !defined(GD32_TIM13_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM13_NUMBER, GD32_GPT_TIM13_IRQ_PRIORITY, GD32_GPT_TIM13_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM13CLK)
      gptp->clock = GD32_TIM13CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM14
    if (&GPTD14 == gptp) {
      rccEnableTIM14(true);
      rccResetTIM14();
#if !defined(GD32_TIM14_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM14_NUMBER, GD32_GPT_TIM14_IRQ_PRIORITY, GD32_GPT_TIM14_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM14CLK)
      gptp->clock = GD32_TIM14CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM15
    if (&GPTD15 == gptp) {
      rccEnableTIM15(true);
      rccResetTIM15();
#if defined(GD32_TIM15CLK)
      gptp->clock = GD32_TIM15CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM16
    if (&GPTD16 == gptp) {
      rccEnableTIM16(true);
      rccResetTIM16();
#if defined(GD32_TIM16CLK)
      gptp->clock = GD32_TIM16CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM17
    if (&GPTD17 == gptp) {
      rccEnableTIM17(true);
      rccResetTIM17();
#if defined(GD32_TIM17CLK)
      gptp->clock = GD32_TIM17CLK;
#else
      gptp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_GPT_USE_TIM21
    if (&GPTD21 == gptp) {
      rccEnableTIM21(true);
      rccResetTIM21();
#if !defined(GD32_TIM21_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM21_NUMBER, GD32_GPT_TIM21_IRQ_PRIORITY, GD32_GPT_TIM21_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM21CLK)
      gptp->clock = GD32_TIM21CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_GPT_USE_TIM22
    if (&GPTD22 == gptp) {
      rccEnableTIM22(true);
      rccResetTIM22();
#if !defined(GD32_TIM22_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM22_NUMBER, GD32_GPT_TIM22_IRQ_PRIORITY, GD32_GPT_TIM22_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM22CLK)
      gptp->clock = GD32_TIM22CLK;
#else
      gptp->clock = GD32_TIMCLK1;
#endif
    }
#endif
  }

  /* Prescaler value calculation.*/
  psc = (uint16_t)((gptp->clock / gptp->config->frequency) - 1);
  osalDbgAssert(((uint32_t)(psc + 1) * gptp->config->frequency) == gptp->clock,
                "invalid frequency");

  /* Timer configuration.*/
  gptp->tim->CTL0  = 0;                          /* Initially stopped.       */
  gptp->tim->CTL1  = gptp->config->ctl1;
  gptp->tim->PSC  = psc;                        /* Prescaler value.         */
  gptp->tim->INTF   = 0;                          /* Clear pending IRQs.      */
  gptp->tim->DMAINTEN = gptp->config->dmainten &        /* DMA-related DIER bits.   */
                    ~GD32_TIM_DIER_IRQ_MASK;
}

/**
 * @brief   Deactivates the GPT peripheral.
 *
 * @param[in] gptp      pointer to the @p GPTDriver object
 *
 * @notapi
 */
void gpt_lld_stop(GPTDriver *gptp) {

  if (gptp->state == GPT_READY) {
    gptp->tim->CTL0  = 0;                        /* Timer disabled.          */
    gptp->tim->DMAINTEN = 0;                        /* All IRQs disabled.       */
    gptp->tim->INTF   = 0;                        /* Clear pending IRQs.      */

#if GD32_GPT_USE_TIM1
    if (&GPTD1 == gptp) {
#if !defined(GD32_TIM1_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM1_UP_NUMBER);
#endif
      rccDisableTIM1();
    }
#endif

