ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_gpt_lld.c
#if GD32_GPT_USE_TIM2
    if (&GPTD2 == gptp) {
#if !defined(GD32_TIM2_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM2_NUMBER);
#endif
      rccDisableTIM2();
    }
#endif

#if GD32_GPT_USE_TIM3
    if (&GPTD3 == gptp) {
#if !defined(GD32_TIM3_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM3_NUMBER);
#endif
      rccDisableTIM3();
    }
#endif

#if GD32_GPT_USE_TIM4
    if (&GPTD4 == gptp) {
#if !defined(GD32_TIM4_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM4_NUMBER);
#endif
      rccDisableTIM4();
    }
#endif

#if GD32_GPT_USE_TIM5
    if (&GPTD5 == gptp) {
#if !defined(GD32_TIM5_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM5_NUMBER);
#endif
      rccDisableTIM5();
    }
#endif

#if GD32_GPT_USE_TIM6
    if (&GPTD6 == gptp) {
#if !defined(GD32_TIM6_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM6_NUMBER);
#endif
      rccDisableTIM6();
    }
#endif

#if GD32_GPT_USE_TIM7
    if (&GPTD7 == gptp) {
#if !defined(GD32_TIM7_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM7_NUMBER);
#endif
      rccDisableTIM7();
    }
#endif

#if GD32_GPT_USE_TIM8
    if (&GPTD8 == gptp) {
#if !defined(GD32_TIM8_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM8_UP_NUMBER);
#endif
      rccDisableTIM8();
    }
#endif

#if GD32_GPT_USE_TIM9
    if (&GPTD9 == gptp) {
#if !defined(GD32_TIM9_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM9_NUMBER);
#endif
      rccDisableTIM9();
    }
#endif

#if GD32_GPT_USE_TIM10
    if (&GPTD10 == gptp) {
#if !defined(GD32_TIM10_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM10_NUMBER);
#endif
      rccDisableTIM10();
    }
#endif

#if GD32_GPT_USE_TIM11
    if (&GPTD11 == gptp) {
#if !defined(GD32_TIM11_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM11_NUMBER);
#endif
      rccDisableTIM11();
    }
#endif

#if GD32_GPT_USE_TIM12
    if (&GPTD12 == gptp) {
#if !defined(GD32_TIM12_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM12_NUMBER);
#endif
      rccDisableTIM12();
    }
#endif

#if GD32_GPT_USE_TIM13
    if (&GPTD13 == gptp) {
#if !defined(GD32_TIM13_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM13_NUMBER);
#endif
      rccDisableTIM13();
    }
#endif

#if GD32_GPT_USE_TIM14
    if (&GPTD14 == gptp) {
#if !defined(GD32_TIM14_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM14_NUMBER);
#endif
      rccDisableTIM14();
    }
#endif

#if GD32_GPT_USE_TIM15
    if (&GPTD15 == gptp) {
      rccDisableTIM15();
    }
#endif

#if GD32_GPT_USE_TIM16
    if (&GPTD16 == gptp) {
      rccDisableTIM16();
    }
#endif

#if GD32_GPT_USE_TIM17
    if (&GPTD17 == gptp) {
      rccDisableTIM17();
    }
#endif

#if GD32_GPT_USE_TIM21
    if (&GPTD21 == gptp) {
#if !defined(GD32_TIM21_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM21_NUMBER);
#endif
      rccDisableTIM21();
    }
#endif

#if GD32_GPT_USE_TIM22
    if (&GPTD22 == gptp) {
#if !defined(GD32_TIM22_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM22_NUMBER);
#endif
      rccDisableTIM22();
    }
#endif
  }
}

/**
 * @brief   Starts the timer in continuous mode.
 *
 * @param[in] gptp      pointer to the @p GPTDriver object
 * @param[in] interval  period in ticks
 *
 * @notapi
 */
void gpt_lld_start_timer(GPTDriver *gptp, gptcnt_t interval) {

  gptp->tim->CAR = (uint32_t)(interval - 1U);   /* Time constant.           */
  gptp->tim->SWEVG = GD32_TIM_EGR_UG;            /* Update event.            */
  gptp->tim->CNT = 0;                           /* Reset counter.           */

  /* NOTE: After generating the UG event it takes several clock cycles before
     SR bit 0 goes to 1. This is why the clearing of CNT has been inserted
     before the clearing of SR, to give it some time.*/
  gptp->tim->INTF = 0;                            /* Clear pending IRQs.      */
  if (NULL != gptp->config->callback)
    gptp->tim->DMAINTEN |= GD32_TIM_DIER_UIE;      /* Update Event IRQ enabled.*/
  gptp->tim->CTL0 = GD32_TIM_CR1_ARPE | GD32_TIM_CR1_URS | GD32_TIM_CR1_CEN;
}

/**
 * @brief   Stops the timer.
 *
 * @param[in] gptp      pointer to the @p GPTDriver object
 *
 * @notapi
 */
void gpt_lld_stop_timer(GPTDriver *gptp) {

  gptp->tim->CTL0 = 0;                           /* Initially stopped.       */
  gptp->tim->INTF = 0;                            /* Clear pending IRQs.      */

  /* All interrupts disabled.*/
  gptp->tim->DMAINTEN &= ~GD32_TIM_DIER_IRQ_MASK;
}

/**
 * @brief   Starts the timer in one shot mode and waits for completion.
 * @details This function specifically polls the timer waiting for completion
 *          in order to not have extra delays caused by interrupt servicing,
 *          this function is only recommended for short delays.
 *
 * @param[in] gptp      pointer to the @p GPTDriver object
 * @param[in] interval  time interval in ticks
 *
 * @notapi
 */
void gpt_lld_polled_delay(GPTDriver *gptp, gptcnt_t interval) {

  gptp->tim->CAR = (uint32_t)(interval - 1U);   /* Time constant.           */
  gptp->tim->SWEVG = GD32_TIM_EGR_UG;            /* Update event.            */
  gptp->tim->INTF  = 0;                           /* Clear pending IRQs.      */
  gptp->tim->CTL0 = GD32_TIM_CR1_OPM | GD32_TIM_CR1_URS | GD32_TIM_CR1_CEN;
  while (!(gptp->tim->INTF & GD32_TIM_SR_UIF))
    ;
  gptp->tim->INTF = 0;                            /* Clear pending IRQs.      */
}

/**
 * @brief   Shared IRQ handler.
 *
 * @param[in] gptp      pointer to a @p GPTDriver object
 *
 * @notapi
 */
void gpt_lld_serve_interrupt(GPTDriver *gptp) {
  uint32_t sr;

  sr  = gptp->tim->INTF;
  sr &= gptp->tim->DMAINTEN & GD32_TIM_DIER_IRQ_MASK;
  gptp->tim->INTF = ~sr;
  if ((sr & GD32_TIM_SR_UIF) != 0) {
    _gpt_isr_invoke_cb(gptp);
  }
}

#endif /* HAL_USE_GPT */

/** @} */
